Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: We recently alleviated this limitation, and Quarkus can now handle much larger applications. This improvement will also be available in Quarkus 3.31.
ja_jp: 私たちは最近この制限を緩和し、Quarkusはより大規模なアプリケーションを扱えるようになりました。この改善もQuarkus 3.31で利用可能になります。

source: We recently had the situation that we wanted to log our Quarkus application logs to AWS CloudWatch. Basically it takes some time but is not a big deal. Adding a CloudWatch dependency, creating a Log Handler and push the logs to CloudWatch via the provided AWS CloudWatch API. But what if you want to share it with others? Of course you could put it on GitHub as part of your project so others can copy and paste it, but that’s not the most elegant way to share code with others.
ja_jp: 最近、QuarkusのアプリケーションログをAWS CloudWatchにロギングしたいという状況になりました。基本的には時間がかかりますが、大したことではありません。CloudWatchの依存関係を追加し、Log Handlerを作成し、提供されているAWS CloudWatch APIを介してCloudWatchにログをプッシュします。しかし、それを他の人と共有したい場合はどうでしょうか？もちろん、プロジェクトの一部としてGitHubに置いて、他の人がコピー＆ペーストできるようにすることもできますが、それはコードを他の人と共有する最もエレガントな方法ではありません。

source: We recommend continuing the journey with the xref:deploying-to-kubernetes.adoc[deployment to Kubernetes and OpenShift].
ja_jp: xref:deploying-to-kubernetes.adoc[Kubernetes と OpenShift へのデプロイメント] で探検を続けることをお勧めします。

source: We recommend enabling pinning detection in tests. Thus, you can check that your application behaves correctly when using virtual threads. Just check your log after having run the test. If you see a stack trace (on Java 21-23) or pinning events (using the junit-virtual-threads extension), better check what's wrong. If your code (or one of your dependencies) pins, it might be better to use regular worker threads instead.
ja_jp: テストでピン留め検出を有効にすることをお勧めします。 これにより、仮想スレッドを使用しているときにアプリケーションが正しく動作することを確認できます。 テストを実行した後、ログを確認してください。 スタックトレース (Java 21-23 の場合) やピン留めイベント (junit-virtual-threads エクステンションを使用している場合) が表示される場合は、何が問題なのかを確認することをお勧めします。 コード (または依存関係のいずれか) がピン留めする場合は、代わりに通常のワーカー スレッドを使用する方が良いかもしれません。

source: We recommend enabling this flag in tests. Thus, you can check that your application behaves correctly when using virtual threads. Just check your log after having run the test. If you see a stack trace... better check what's wrong. If your code (or one of your dependencies) pins, it might be better to use regular worker thread instead.
ja_jp: テストでこのフラグを有効にすることをお勧めします。 こうすることで、仮想スレッドを使用したときにアプリケーションが正しく動作することを確認できます。テストを実行した後のログをチェックしてください。 スタックトレースが表示されたら、何が問題なのかを調べましょう。もしあなたのコード (あるいは依存関係) がピンなら、代わりに通常のワーカースレッドを使ったほうがよいかもしれません。

source: We recommend following the instructions in the upcoming sections to create the application step by step. If you prefer, you can skip ahead to the completed example.
ja_jp: アプリケーションを段階的に作成するには、次のセクションの指示に従うことを推奨します。 必要に応じて、完成した例に進むこともできます。

source: We recommend that new events be associated with existing events. Associations are useful when looking at the details of a process that is taking a long time. For example, a general REST application retrieves the data needed for processing from a datastore. If REST events are not associated with datastore events, it is impossible to know which datastore events were processed in each REST request. When the two events are associated, we know immediately which datastore event was processed in each REST request.
ja_jp: 新しいイベントは既存のイベントに関連付けることを推奨します。 関連付けは、長い時間がかかっているプロセスの詳細を確認するときに役立ちます。 たとえば、一般的な REST アプリケーションは、処理に必要なデータをデータストアから取得します。 REST イベントがデータストアイベントに関連付けられていない場合、各 REST リクエストでどのデータストアイベントが処理されたかを知ることはできません。 2 つのイベントが関連付けられると、各 REST リクエストでどのデータストアイベントが処理されたかがすぐにわかります。

source: We recommend that you complete each step in the following sections to create the application. However, you can proceed directly to the completed solution as follows:
ja_jp: アプリケーションを作成するには、以下のセクションの各ステップを完了することをお勧めします。ただし、以下のように、完成したソリューションを直接利用することもできます:

source: We recommend that you follow the instructions from <<Bootstrapping the project>> onwards to create the application step by step.
ja_jp: <<Bootstrapping the project>> 以降の指示に従って、アプリケーションを段階的に作成することを推奨します。

source: We recommend that you follow the instructions from <<bootstrapping-the-project,Bootstrapping project>> and onwards to create the application step by step.
ja_jp: <<bootstrapping-the-project,プロジェクトのブートストラップ>>とそれ以降の解説に従って、ステップバイステップでアプリを作成していくことをお勧めします。

source: We recommend that you follow the instructions from <<bootstrapping-the-project,Bootstrapping the project>> and onwards to create the application step by step.
ja_jp: <<bootstrapping-the-project,プロジェクトのブートストラップ>> 以降の指示に従って、ステップバイステップでアプリケーションを作成することをお勧めします。

source: We recommend that you follow the instructions from xref:bootstrapping-the-project[Bootstrapping the project] and onwards to create the application step by step.
ja_jp: xref:bootstrapping-the-project[プロジェクトのブートストラップ] 以降の指示に従って、ステップバイステップでアプリケーションを作成することをお勧めします。

source: We recommend that you follow the instructions in the following sections and create the application step by step. However, you can go right to the completed example.
ja_jp: 次の章で紹介する手順に沿って、ステップを踏んでアプリを作成することをお勧めします。ただし、完成した例にそのまま進んでも構いません。

source: We recommend that you follow the instructions in the next sections and create applications step by step. However, you can go right to the completed example.
ja_jp: 次の章で紹介する手順に沿って、ステップを踏んでアプリを作成することをお勧めします。ただし、完成した例にそのまま進んでも構いません。

source: We recommend that you follow the instructions in the next sections and create the application step by step. However, you can go right to the completed example.
ja_jp: 次の章で紹介する手順に沿って、ステップを踏んでアプリを作成することをお勧めします。ただし、完成した例にそのまま進んでも構いません。

source: We recommend that you follow the instructions in the next sections and create the application step by step.
ja_jp: 次項の説明に従って、一歩一歩アプリケーションを作成していくことをお勧めします。

source: We recommend that you follow the instructions in the next sections and create the application step by step. However, you can go right to the complete example.
ja_jp: 次の章で紹介する手順に沿って、ステップを踏んでアプリを作成することをお勧めします。ただし、完成した例にそのまま進んでも構いません。

source: We recommend that you follow the instructions in the next sections and create the application step by step. However, you can skip right to the completed example.
ja_jp: 次の章で紹介する手順に沿って、ステップを踏んでアプリを作成することをお勧めします。ただし、すぐに完成した例に飛んでも構いません。

source: We recommend that you follow the instructions in the next sections and create the application step by step. You can skip right to the solution if you prefer. Either:
ja_jp: 次のセクションで紹介する手順に沿って、ステップを踏んでアプリを作成することをお勧めします。ただし、完成した例にそのまま進んでも構いません。

source: We recommend that you follow the instructions in the next sections and create the application step by step. However, you can go right to the completed example. Clone the Git repository: `git clone {quickstarts-clone-url}`, or download an {quickstarts-archive-url}[archive].
ja_jp: 次の章で紹介する手順に沿って、ステップを踏んでアプリを作成することをお勧めします。しかし、完成した例にすぐに進むことができます。Git リポジトリをクローンします: `git clone {quickstarts-clone-url}` 、または {quickstarts-archive-url}[archive] をダウンロードします。

source: We recommend that you follow the instructions in the next sections and create the application step by step. However, you can skip to the completed example.
ja_jp: 次のセクションの指示に従って、段階的にアプリケーションを作成していくことをお勧めします。ただし、完成した例までスキップすることもできます。

source: We recommend that you follow the instructions in the next sections and create the applications step by step. However, you can go right to the completed example.
ja_jp: 次のセクションの指示に従って、段階的にアプリケーションを作成することをお勧めします。しかし、完成した例をすぐに見ることもできます。

source: We recommend that you follow the instructions in the next sections and package the application step by step. However, you can go right to the completed example.
ja_jp: 次のセクションの手順に従って、アプリケーションを段階的にパッケージ化することをお勧めします。しかしながら、完成したサンプルに直接進むこともできます。

source: We recommend that you follow the instructions to create the application step by step, but you can skip right to the solution if you prefer. Either:
ja_jp: 手順に沿ってアプリケーションを作成することをお勧めしますが、必要に応じてソリューションに進むことも可能です。以下のいずれかを実行します。

source: We recommend the usage of the Vert.x based gRPC server, as it is more flexible and better integrated in the Quarkus ecosystem.
ja_jp: より柔軟性が高く、Quarkus エコシステムとの統合性も優れているため、Vert.x ベースの gRPC サーバーの使用が推奨されます。

source: We recommend the xref:observability-devservices-lgtm.adoc[Getting Started with Grafana-OTel-LGTM].
ja_jp: xref:observability-devservices-lgtm.adoc[Grafana-OTel-LGTM の使用] が推奨されます。

source: We recommend to use the following configuration when running tests in application using virtual threads. If would not fail the tests, but at least dump start traces if the code pins the carrier thread:
ja_jp: 仮想スレッドを使用するアプリケーションでテストを実行する場合は、以下の設定を使用することをお勧めします。 テストが失敗することはありませんが、コードがキャリアのスレッドをピン留めした場合は、少なくともスタートトレースをダンプします：

source: We recommend using the Mutiny variant as it integrates with the other reactive APIs provided by Quarkus.
ja_jp: Mutiny版は、Quarkusが提供する他のリアクティブAPIと統合されているため、Mutiny版の使用をお勧めします。

source: We recommend using the following configuration when running tests in applications using virtual threads. It will not fail the tests, but at least dump stack traces if the code pins the carrier thread:
ja_jp: 仮想スレッドを使用するアプリケーションでテストを実行する際には、以下の設定を使用することをお勧めします。 これはテストを失敗させることはありませんが、コードがキャリアスレッドをピニングした場合、少なくともスタックトレースをダンプします:

source: We register a Junit Extension which will start a Quarkus application with the Greeting extension.
ja_jp: Greeting エクステンションで Quarkus アプリを起動する Junit エクステンションを登録します。

source: We released 1.13.5.Final today with a new set of bugfixes for our 1.13 release.
ja_jp: 本日、1.13リリースのバグフィックスを含む1.13.5.Finalをリリースしました。

source: We released Quarkus 2.10.0.Final which starts the exploratory work for Loom's virtual threads and refines a lot of extensions.
ja_jp: Loomの仮想スレッドの探索的な作業を開始し、多くのエクステンションを改良したQuarkus 2.10.0.Finalをリリースしました。

source: We released Quarkus 2.11.1.Final and 2.10.4.Final to fix CVE-2022-2466. Quarkus 2.11.1.Final also introduces a new Redis Client API and customization abilities for some extensions.
ja_jp: CVE-2022-2466を修正したQuarkus 2.11.1.Finalと2.10.4.Finalがリリースされました。また、Quarkus 2.11.1.Finalでは、新しいRedisクライアントAPIと、一部のエクステンションに対するカスタマイズ機能が追加されました。

source: We released Quarkus 2.13.0.Final which, among a lot of smaller enhancements, comes with a cross site request forgery prevention filter and a Kafka Client Dev UI.
ja_jp: Quarkus 2.13.0.Final をリリースしました。このバージョンには、クロスサイトリクエストフォージェリー（CSRF）防止フィルターとKafkaクライアントDev UIが追加されています。

source: We released Quarkus 2.14.0.Final with a lot of both internal and user facing improvements.
ja_jp: Quarkus 2.14.0.Finalをリリースし、内部およびユーザーに見える部分に多くの改善を行いました。

source: We released Quarkus 2.9.0.Final with exciting new features such as a brand new WebAuthn extension
ja_jp: Quarkus 2.9.0.Finalをリリースし、新しいWebAuthnエクステンションなど、エキサイティングな新機能を追加しました。

source: We released Quarkus 3.20.5, the next maintenance release for the 3.20 LTS stream.
ja_jp: Quarkus 3.20.5 をリリースしました。これは 3.20 LTS ストリームの次期メンテナンスリリースです。

source: We released Quarkus 3.20.6, the next maintenance release for the 3.20 LTS stream.
ja_jp: Quarkus 3.20.6 をリリースしました。これは 3.20 LTS ストリームの次期メンテナンスリリースです。

source: We released Quarkus 3.27.2, the next maintenance release for the 3.27 LTS stream.
ja_jp: Quarkus 3.27.2 をリリースしました。これは 3.27 LTS ストリームの次のメンテナンスリリースです。

source: We released Quarkus 3.27.3, the next maintenance release for the 3.27 LTS stream.
ja_jp: Quarkus 3.27.3 をリリースしました。これは 3.27 LTS ストリームの次のメンテナンスリリースです。

source: We released Quarkus 3.30.6, a regular maintenance release, and our first release for 2026.
ja_jp: Quarkus 3.30.6 をリリースしました。これは通常のメンテナンスリリースであり、2026 年最初のリリースです。

source: We released Quarkus 3.30.7, a regular maintenance release.
ja_jp: Quarkus 3.30.7 をリリースしました。これは通常のメンテナンスリリースです。

source: We released Quarkus 3.30.8, a regular maintenance release.
ja_jp: Quarkus 3.30.8 をリリースしました。これは定期的なメンテナンスリリースです。

source: We released Quarkus 3.31.2, a regular maintenance release.
ja_jp: 通常のメンテナンスリリースである Quarkus 3.31.2 をリリースしました。

source: We released Quarkus 3.31.3, a regular maintenance release.
ja_jp: Quarkus 3.31.3 をリリースしました。これは通常のメンテナンスリリースです。

source: We released Quarkus 3.31.4, a regular maintenance release.
ja_jp: Quarkus 3.31.4 (通常のメンテナンスリリース) をリリースしました。

source: We released Quarkus 3.32, which will be the foundation of our next LTS. It comes with Project Leyden integration, more graceful shutdown, automatic Consul registration, new security features and several component updates.
ja_jp: Quarkus 3.32 をリリースしました。これは次期 LTS の基盤となります。Project Leyden の統合、より優雅なシャットダウン、自動 Consul 登録、新しいセキュリティ機能、およびいくつかのコンポーネントの更新が含まれています。

source: We released Quarkus 3.32.2, a regular maintenance release.
ja_jp: Quarkus 3.32.2 をリリースしました。これは定期的なメンテナンスリリースです。

source: We released Quarkus 3.32.3, a regular maintenance release.
ja_jp: Quarkus 3.32.3 をリリースしました。これは通常のメンテナンスリリースです。

source: We released Quarkus 3.33 LTS, our new LTS version.
ja_jp: 新しいLTSバージョンであるQuarkus 3.33 LTSをリリースしました。

source: We released Quarkus 3.34, which comes with a lot of enhancements across the board.
ja_jp: Quarkus 3.34 をリリースしました。これには全体的に多くの機能強化が施されています。

source: We released Quarkus 3.34.2, a regular maintenance release.
ja_jp: Quarkus 3.34.2 をリリースしました。これは定期的なメンテナンスリリースです。

source: We released Quarkus 3.34.3, a regular maintenance release.
ja_jp: 通常のメンテナンスリリースである Quarkus 3.34.3 をリリースしました。

source: We replaced that code, only to discover another issue: `BigDecimal` was also being eagerly initialized in Hibernate ORM for a very narrow use case in the `DurationJavaType` class. That has since been fixed as well.
ja_jp: そのコードを置き換えましたが、別の問題が見つかりました。 Hibernate ORM の `DurationJavaType` クラス内の非常に限定的なユースケースでも、 `BigDecimal` が先行して初期化されていました。これもすでに修正されています。

source: We searched also how much CPU was needed to get a deployment under 60 seconds.
ja_jp: また、デプロイメントを60秒以下にするために、どれだけのCPUが必要かを調べました。

source: We see RESTEasy Reactive as becoming the default HTTP layer in Quarkus in the near future and are completely committed to making it perform at the best possible level while also introducing new features that spark developer joy!
ja_jp: RESTEasy Reactive は、近い将来 Quarkus のデフォルト HTTP レイヤーになると思われます。また、開発者にうれしい新機能を導入しながら、可能な限り最高のパフォーマンスを実現することに完全にコミットしています。

source: We see a big majority of time spent in what is supposed to be our main, but we see no trace of the `StringBuilderResource` class, nor the `StringBuilder` class we're calling. We should look at the symbol table of the binary: can we find symbols for our class and `StringBuilder`? We need those in order to get meaningful data. From within the tools container, query the symbol table:
ja_jp: メインとなるはずのものに大半の時間が費やされていることがわかりますが、呼び出している `StringBuilderResource` クラスや `StringBuilder` クラスの痕跡は見られません。バイナリーのシンボルテーブルを確認する必要があります。クラスと `StringBuilder` のシンボルを見つけることができますか? 意味のあるデータを取得するためにそれらが必要です。ツールコンテナー内から、シンボルテーブルをクエリーします。

source: We see that the value of the `first` key is now `37` which is exactly the result of `10 + 27`, quick maths.
ja_jp: `first` キーの値が `37` になっていることがわかりますが、これはまさに簡単な計算である `10 + 27` の結果と同じです。

source: We send the request (indexing request here) to Elasticsearch.
ja_jp: Elasticsearchにリクエスト(ここではインデックス作成のリクエスト)を送信します。

source: We send the request to Elasticsearch.
ja_jp: Elasticsearchにリクエストを送信します。

source: We shall leave the coordinator running (on the default port) while we develop and test services that use LRAs. Towards the end of article we will show how to embed coordinators with services (NOTE: you cannot use this approach to run coordinators in native mode, a future extension will be provided to support this requirement).
ja_jp: ここでは、LRAを使用するサービスを開発・テストする間、コーディネーターを（デフォルトのポートで）稼働させておきます。記事の最後では、コーディネーターをサービスに組み込む方法を紹介します（注意：この方法では、コーディネーターをネイティブ・モードで実行することはできませんが、将来的にはこの要件をサポートするエクステンションが提供される予定です）。

source: We shared our excitement about Project Leyden and how it gave us a new perspective on Java application startup performance in a previous https://quarkus.io/blog/leyden-1/[blog post].
ja_jp: 以前の https://quarkus.io/blog/leyden-1/[ブログ記事] で、Project Leyden と、それが Java アプリケーションの起動パフォーマンスに新たな視点を与えてくれたことへの熱意を共有しました。

source: We should avoid this. It has a cost, and that cost is paid at **every single** startup of every application using these libraries.
ja_jp: これを避けるべきです。これにはコストがかかり、そのコストはこれらのライブラリーを使用するすべてのアプリケーションの **起動のたびに** 支払われます。

source: We should have the Infinispan server running thanks to the Dev Services. We can access the Dev Services UI through `http://localhost:8080/q/dev/`. The Dev UI should display the Infinispan UI Panel.
ja_jp: Dev Servicesのおかげで、Infinispanサーバが稼働しているはずです。Dev ServicesのUIには、 `http://localhost:8080/q/dev/` でアクセスできます 。Dev UIにInfinispan UI Panelが表示されるでしょう。

source: We simplified the configuration for well-known OIDC providers such as GitHub, Google, Apple... More information can be found in link:/guides/security-openid-connect-web-authentication[the guide].
ja_jp: GitHub、Google、Appleなどの有名なOIDCプロバイダーの設定を簡素化しました。詳しくは link:/guides/security-openid-connect-web-authentication[ガイド] を参照してください。

source: We spent a lot of time stabilizing the release due to the introduction of support for the https://quarkus.io/guides/qute[Qute templating engine]. We've written a fault-tolerant parser for it, provided various diagnostics, code actions, completions, and done our best to make the integration between Java source files and Qute template files very smooth. In fact, there's so much new functionality there that we plan to do a separate post entirely on Qute support within the Quarkus extension. However, there’s plenty of improvements in the Quarkus tooling as well as to the underlying MicroProfile tooling.
ja_jp: link:https://quarkus.io/guides/qute[Quteテンプレートエンジン] のサポートが導入されたため、リリースの安定化に多くの時間を費やしました。私たちは、そのために耐障害性のあるパーサーを書き、様々な診断、コードアクション、補完を提供し、JavaソースファイルとQuteテンプレートファイル間の統合が非常にスムーズになるように最善を尽くしました。実際、非常に多くの新機能があるので、Quarkusエクステンション内のQuteサポートについては、別の記事を作成する予定です。しかし、Quarkusのツールにも、基盤となるMicroProfileのツールにも、多くの改良点があります。

source: We spotted a regression in the Caffeine extension and decided to skip the announcement of 1.10.0.Final altogether. And then we spotted an issue with the Platform BOM and had to release a 1.10.2.Final.
ja_jp: Caffeine エクステンションのリグレッションを発見しました。そのため 1.10.0.Final の発表をスキップしました。そして、Platform BOM の問題を発見しました。なので 1.10.2.Final をリリースしなければなりませんでした。

source: We start looping in a shell, sending requests to the rest endpoint of the sample application we are testing.
ja_jp: シェル内でループを開始し、テストしているサンプルアプリケーションのRESTエンドポイントにリクエストを送信します。

source: We started with working through the original https://how-to.vertx.io/web-and-oauth2-oidc/#create-a-project[Securing a Web Application with OAuth2/OpenID Connect] tutorial in the <<vertx-oidc-vertx>> section. And in the <<vertx-oidc-quarkus>> section, we converted it to run on Quarkus, while retaining Vert.x OIDC.
ja_jp: <<vertx-oidc-vertx>> セクションでオリジナルの https://how-to.vertx.io/web-and-oauth2-oidc/#create-a-project[Securing a Web Application with OAuth2/OpenID Connect] チュートリアルを進めました。そして <<vertx-oidc-quarkus>> セクションでは、Vert.x OIDC を保持したまま、Quarkus で動作するように変換しました。

source: We still need to configure the URL for the client, so let's put this into `application.properties`:
ja_jp: クライアント用のURLを設定する必要がありますので、これを `application.properties` に入れてみましょう:

source: We strongly recommend upgrading to 3.32 soon so we can gather feedback and ensure the upcoming 3.33 LTS is as solid as possible.
ja_jp: 早急に 3.32 にアップグレードすることを強くお勧めします。これにより、フィードバックを収集し、今後の 3.33 LTS が可能な限り安定していることを確認できます。

source: We strongly suggest adopting a contract-first approach using a schema registry. To learn more about how to use Apache Kafka with the schema registry and Avro, follow the xref:kafka-schema-registry-avro.adoc[Using Apache Kafka with Schema Registry and Avro] guide for Avro or you can follow the xref:kafka-schema-registry-json-schema.adoc[Using Apache Kafka with Schema Registry and JSON Schema] guide..
ja_jp: スキーマレジストリを使用したコントラクトファーストアプローチを採用することを強くお勧めします。 スキーマレジストリとAvroを使用したApache Kafkaの使用方法の詳細については、Avroの xref:kafka-schema-registry-avro.adoc[スキーマレジストリとAvroを使用したApache Kafka] ガイドを参照するか、 xref:kafka-schema-registry-json-schema.adoc[スキーマレジストリとJSONスキーマを使用したApache Kafka] ガイドを参照してください。

source: We strongly suggest adopting a contract-first approach using a schema registry. To learn more about how to use Apache Kafka with the schema registry and Avro, follow the xref:kafka-schema-registry-avro.adoc[Using Apache Kafka with Schema Registry and Avro] guide.
ja_jp: スキーマレジストリーを使用した契約ファーストのアプローチを採用することを強くお勧めします。スキーマレジストリーと Avro で Apache Kafka を使用する方法の詳細については、xref:kafka-schema-registry-avro.adoc[スキーマレジストリーと Avro での Apache Kafka の使用方法] ガイドを参照してください。

source: We stumbled upon this because we were using `BigDecimal` to perform some calculations when printing the Quarkus startup time.
ja_jp: 私たちがこれに遭遇したのは、Quarkus の起動時間を出力する際にいくつかの計算を行うために `BigDecimal` を使用していたからです。

source: We suggest you have the following materials nearby:
ja_jp: 以下の資料を近くに置いておくことをお勧めします。

source: We take a look at some of the new features in the Quarkus Tools for VS Code release.
ja_jp: Quarkus Tools for VS Codeリリースの新機能のいくつかをご紹介します。

source: We talk about what the `@Toaster` annotation is doing in this example.
ja_jp: この例では、 `@Toaster` アノテーションが何を行っているのかについて説明しています。

source: We took a little break, but now another Newsletter round of stories found!
ja_jp: 少しお休みをとっていましたが、かなりの量の見つかったストーリーのニュースレターを発行します!

source: We tried our best to make sure the change would be seamless by putting together Maven relocations. So your applications should still work and you will see a warning asking you to move to the new extensions. If you have any issue with the migration, please report it and we will have a look.
ja_jp: この変更がシームレスに行われるように、Maven relocations を使って最善を尽くしました。そのため、アプリケーションは引き続き動作し、新しいエクステンションへの移行を促す警告が表示されるはずです。移行に関して何か問題がある場合は、報告していただければ確認します。

source: We updated Camel Quarkus to Camel Quarkus 3.32. For more information, see the https://camel.apache.org/blog/2026/02/camel-quarkus-3.32.0/[announcement].
ja_jp: Camel Quarkus を Camel Quarkus 3.32 に更新しました。 詳細については、 https://camel.apache.org/blog/2026/02/camel-quarkus-3.32.0/[発表]を参照してください。

source: We upgraded H2 to from 1.4 to 2.1.
ja_jp: H2を1.4から2.1へアップグレードしました。

source: We upgraded Kotlin to 1.6.
ja_jp: Kotlinを1.6にアップグレードしました。

source: We upgraded our Kotlin extension and tooling to 1.5, namely 1.5.21.
ja_jp: Kotlinエクステンションとツールを1.5にアップグレードしました（1.5.21）。

source: We upgraded to GraalVM 21.0.
ja_jp: GraalVM 21.0にアップグレードしました。

source: We upgraded to Hibernate ORM 5.4.27.SP1 which fixes an important issue, potentially causing data losses.
ja_jp: Hibernate ORM 5.4.27.SP1 にアップグレードし、データ損失を引き起こす可能性のある重要な問題が修正されました。

source: We upgraded to JUnit 6 (the update is relatively straightforward) and Testcontainers 2 (which comes with a lot more breaking changes).
ja_jp: JUnit 6（更新は比較的簡単）とTestcontainers 2（より多くの破壊的変更を伴う）にアップグレードしました。

source: We upgraded to Jackson 2.12.6 to fix https://github.com/FasterXML/jackson-databind/issues/3328[a security issue in Jackson Databind].
ja_jp: Jackson 2.12.6にアップグレードし、 link:https://github.com/FasterXML/jackson-databind/issues/3328[Jackson Databindのセキュリティ問題]を修正しました。

source: We upgraded to Scala 2.13. Note that there is a https://github.com/quarkiverse/quarkus-scala3[Scala 3 extension in the Quarkiverse].
ja_jp: Scala 2.13にアップグレードしました。なお、 link:https://github.com/quarkiverse/quarkus-scala3[QuarkiverseにはScala 3エクステンション] があります。

source: We use Vert.x `JsonObject` to serialize the object before sending it to Elasticsearch, you can use whatever you want to serialize to JSON.
ja_jp: Elasticsearchに送信する前にオブジェクトをシリアライズするためにVert.x `JsonObject` を使用していますが、JSONにシリアライズしたものは何でも使えます。

source: We use Vert.x `JsonObject` to serialize the object before sending it to Elasticsearch, you can use whatever you want to serialize your objects to JSON.
ja_jp: Elasticsearch に送る前にオブジェクトをシリアライズするために Vert.x `JsonObject` を使用しています。オブジェクトを JSON にシリアライズするために好きなものを使用することができます。
